_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_СводнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлаваССРС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазбивкаПоГодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_СметаПечатьВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует печатные формы акта выполненных работ.
//
// Параметры:
//     МассивОбъектов  			- Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати 			- Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм 	- ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         	- СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                                  в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       	- Структура       - дополнительные параметры сформированных табличных документов
//                                                 (выходной параметр).
//
Процедура ПечатьАкта(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_12_МОЭ",
	НСтр("ru = 'Акт выполненных работ (12 граф) Мособлэкспертиза'"),
	МассивОбъектов,              
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_12_МОЭ");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_12",
	НСтр("ru = 'Акт выполненных работ (12 граф)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_12");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_14",
	НСтр("ru = 'Акт выполненных работ (14 граф)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_14");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_НРиСП",
	НСтр("ru = 'Акт выполненных работ с НР и СП'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_НРиСП");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_КС2",
	НСтр("ru = 'КС-2'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_КС2");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_КС2_8_Рес",
	НСтр("ru = 'КС-2 (8 граф) ресурсный'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_КС2_8_Рес");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_РМ12_Рес",
	НСтр("ru = 'КС-2 (8 граф) ресурсный'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_РМ12_Рес");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_ТСН11а",
	НСтр("ru = 'Акт выполненных работ (методика ТСН форма 1а)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_ТСН11а");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_ТСН11б",
	НСтр("ru = 'Акт выполненных работ (методика ТСН форма 1б)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_ТСН11б");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_ТСН9в",
	НСтр("ru = 'Акт выполненных работ (методика ТСН форма 1в)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_ТСН9в");  
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_АКТ_2В",
	НСтр("ru = 'Акт выполненных работ форма 2В'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_АКТ_2В");  
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_АКТ_ВСМ",
	НСтр("ru = 'Ведомость на списание материалов к акту.'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_АКТ_ВСМ");  
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_АКТ_ОРМ",
	НСтр("ru = 'Отчет о расходе материалов к акту.'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_АКТ_ОРМ");  

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ОтчетМ29",
	НСтр("ru = 'Отчет о расходе ресурсов (М-29)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"ОтчетМ29");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ОтчетМ29Материалы",
	НСтр("ru = 'Отчет о расходе ресурсов (М-29) (материалы)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"ОтчетМ29");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ОтчетВыполненныеРаботы",
	НСтр("ru = 'Справка об объемах выполненных работ'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"ОтчетВыполненныеРаботы");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ОтчетКС3",
		НСтр("ru = ''Справка о стоимости выполненных работ и затрат'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОтчетКС3");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_Акт_РасчетЗатратНаУплатуНДСприУСН",
		НСтр("ru = 'Расчет затрат на уплату НДС при УСН'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_РасчетЗатратНаУплатуНДСприУСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"Приложение",
		НСтр("ru = 'Приложение'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_СМ_ПриложениеКСметеАкту");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ОтчетМ19",
		НСтр("ru = 'Отчет (М-19)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОтчетМ19");

КонецПроцедуры

// Формирует печатные формы локальной сметы.
//
// Параметры:
//     МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати - Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                               в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                              (выходной параметр).
//
Процедура ПечатьЛокальнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_13",
		НСтр("ru = 'Локальная смета (13 граф)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_13");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_11",
		НСтр("ru = 'Локальная смета (11 граф)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_11");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_13_НРиСП",
		НСтр("ru = 'Локальная смета (13 граф) с НР и СП'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_13_НРиСП");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_11_НРиСП",
		НСтр("ru = 'Локальная смета (11 граф) с НР и СП'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_11_НРиСП");	
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_12",
		НСтр("ru = 'Локальная смета (12 граф) Мособлэкспертиза'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_12");	
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_9_Рес",
		НСтр("ru = 'Локальная смета (9 граф) Ресурсная'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_9_Рес");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_12_Рес",
		НСтр("ru = 'Локальная смета (12 граф) Ресурсная'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_12_Рес");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_7_Рес",
		НСтр("ru = 'Локальная смета (7 граф) Ресурсная'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_7_Рес");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ОтчетКС3",
		НСтр("ru = ''Справка о стоимости выполненных работ и затрат'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОтчетКС3");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_РасчетЗатратНаУплатуНДСприУСН",
		НСтр("ru = 'Расчет затрат на уплату НДС при УСН'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_РасчетЗатратНаУплатуНДСприУСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_11ТСН",
		НСтр("ru = 'Локальная смета(методика ТСН форма 1а'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_11ТСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_12ТСН",
		НСтр("ru = 'Локальная смета(методика ТСН форма 1б'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_12ТСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_13ТСН",
		НСтр("ru = 'Локальная смета(методика ТСН форма 1в'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_13ТСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"Приложение",
		НСтр("ru = 'Приложение'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОбщийМакет.ПФ_MXL_СМ_ПриложениеКСметеАкту");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_ЛС_1_Рес",
		НСтр("ru = 'Приложение 2 к ГНОССС в РК (подробная)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_СМ_КЗ_ЛС_1_Рес");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_ЛС_2_Рес",
		НСтр("ru = 'Приложение 2 к ГНОССС в РК'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_СМ_КЗ_ЛС_2_Рес");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_Макет_Форма4",
		НСтр("ru = 'Форма №4'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОбщийМакет.ПФ_MXL_Макет_Форма4");

КонецПроцедуры

// Формирует печатные формы объектной сметы/
//
// Параметры:
//     МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати - Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                               в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                              (выходной параметр).
//
Процедура ПечатьОбъектнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_МакетОС",
		НСтр("ru = 'Объектная смета'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ОбъектнаяСмета.ПФ_MXL_МакетОС");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_МакетОС",
		НСтр("ru = 'Объектная смета (Кзахстан)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ОбъектнаяСмета.ПФ_MXL_СМ_КЗ_МакетОС");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_Макет_Форма4",
		НСтр("ru = 'Форма №4'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОбщийМакет.ПФ_MXL_Макет_Форма4");

КонецПроцедуры
	
// Формирует печатные формы сводной сметы.
//
// Параметры:
//     МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати - Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                               в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                              (выходной параметр).
//
Процедура ПечатьСводнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_МакетСС",
		НСтр("ru = 'Сводный сметный расчет'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_СводнаяСмета.ПФ_MXL_МакетСС");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_МакетСС",
		НСтр("ru = 'Сметный расчет стоимости строительства (Казахстан)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_СводнаяСмета.ПФ_MXL_СМ_КЗ_МакетСС");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_МакетСС_Сводный",
		НСтр("ru = 'Сводный сметный расчет (Казахстан)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_СводнаяСмета.ПФ_MXL_СМ_КЗ_МакетСС_Сводный");

КонецПроцедуры

#КонецОбласти
